Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаПоступленияРС(Команда)
	ОбработкаПоступленияРСНаСервере(); 
	Сообщить("Закончил");

КонецПроцедуры

&НаСервере
Процедура ОбработкаПоступленияРСНаСервере()
	ПС = ПланыСчетов["Хозрасчетный"];
	Счет9102      = ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
	Счет5703      = ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам;

	ВыборкаДокументов = Документы.ПоступлениеНаРасчетныйСчет.Выбрать(НачалоДня(НачПериода), КонецДня(КонПериода));
	Пока ВыборкаДокументов.Следующий() Цикл
  		ИскомыйДокумент = ВыборкаДокументов.ПолучитьОбъект();
		Назн=СокрЛП(ИскомыйДокумент.НазначениеПлатежа);
		кафеесть=Найти (Назн,"070000095426");
		мойкаесть=Найти (Назн,"070000016122");
		Комиссияесть=Найти (Назн,"Комиссия");
попытка		
		Если кафеесть<>0 Тогда
		Комиссия = ВыделитьСлово(СокрЛП(Сред(Назн,Комиссияесть+8)));
		Комиссия = Лев(Комиссия,СтрДлина(Комиссия)-1);
		КомиссияЧ = Число(Комиссия);
		ИскомыйДокумент.ВидОперации=Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам;	
		
		Для каждого СтрТабЧасти из ИскомыйДокумент.РасшифровкаПлатежа Цикл
			СтрТабЧасти.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("000001727") ;
			СтрТабЧасти.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000055") ;
			СтрТабЧасти.СчетУчетаРасчетовСКонтрагентом = Счет5703;
		КонецЦикла;	
		
		ИскомыйДокумент.СчетУчетаРасчетовСКонтрагентом = Счет9102;
		ИскомыйДокумент.СуммаУслуг=КомиссияЧ;
		ИскомыйДокумент.СубконтоКт1= Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("00058") ;
		ИскомыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("кафе //"+ ИскомыйДокумент ); 
		КонецЕсли;
	
	   	Если мойкаесть<>0 Тогда
		Комиссия = ВыделитьСлово(СокрЛП(Сред(Назн,Комиссияесть+8)));
		Комиссия = Лев(Комиссия,СтрДлина(Комиссия)-1);
		КомиссияЧ = Число(Комиссия);
		ИскомыйДокумент.ВидОперации=Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам;	

		Для каждого СтрТабЧасти из ИскомыйДокумент.РасшифровкаПлатежа Цикл

			СтрТабЧасти.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("000000924") ;
			СтрТабЧасти.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000054") ;
			СтрТабЧасти.СчетУчетаРасчетовСКонтрагентом = Счет5703;
//			Сообщить(Строка(ИскомыйДокумент.СчетУчетаРасчетовСКонтрагентом)+"//"+Строка(СтрТабЧасти.СчетУчетаРасчетовСКонтрагентом));

		КонецЦикла;	
		ИскомыйДокумент.СчетУчетаРасчетовСКонтрагентом = Счет9102;
		ИскомыйДокумент.СуммаУслуг=КомиссияЧ;
		ИскомыйДокумент.СубконтоКт1= Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("00057") ;
		ИскомыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	Сообщить("мойка //"+ ИскомыйДокумент );
	КонецЕсли;	

	
	
исключение
	Сообщить("ошибочки");
КонецПопытки;
	КонецЦикла ;
	
КонецПроцедуры      

ТекДата = ТекущаяДата();
НачПериода = НачалоДня(НачалоМесяца(ТекДата));
КонПериода = КонецДня(КонецМесяца(ТекДата));
НадписьПериод = "" + ПредставлениеПериода(НачалоДня(НачПериода), КонецДня(КонПериода), "ФП = Истина");
